# 数据参数设置
################################ APCI ################################
APCI_SIZE = 6  # byte
U_ACTIONS = ( 
    'STARTDT ACTIVATE', 
    'STARTDT ACK', 
    'STOPDT ACTIVATE', 
    'STOPDT ACK', 
    'TESTFR ACTIVATE', 
    'TESTFR ACK', 
)

################################ ASDU ################################
"""类型标识"""
# 在监视方向过程信息的应用服务数据单元
M_SP_NA_1 = 1
M__SP__TA__1 = 2
M__DP__NA__1 = 3
M__DP__TA__1 = 4
M__ST__NA__1 = 5
M__ST__TA__1 = 6
M__BO__NA__1 = 7
M__BO__TA__1 = 8
M__ME__NA__1 = 9
M__ME__TA__1 = 10
M__ME__NB__1 = 11
M__ME__TB__1 = 12
M__ME__NC__1 = 13
M__ME__TC__1 = 14
M__IT__NA__1 = 15
M__IT__TA__1 = 16
M__EP__TA__1 = 17
M__EP__TB__1 = 18
M__EP__TC__1 = 19
M__PS__NA__1 = 20
M__ME__ND__1 = 21
M__SP__TB__1 = 22
M__DP__TB__1 = 23
M__ST__TB__1 = 24
M__BO__TB__1 = 25
M__ME__TD__1 = 26
M__ME__TE__1 = 35
M__ME__TF__1 = 36
M__IT__TB__1 = 37
M__EP__TD__1 = 38
M__EP__TE__1 = 39
M__EP__TF__1 = 40

# 在控制方向过程信息的应用服务数据单元
C__SC__NA__1 = 45
C__DC__NA__1 = 46
C__RC__NA__1 = 47
C__SE__NA__1 = 48
C__SE__NB__1 = 49
C__SE__NC__1 = 50
C__BO__NA__1 = 51

# 在监视方向系统信息的应用服务数据单元
M__EI__NA__1 = 70

# 在控制方向系统信息的应用服务数据单元
C__IC__NA__1 = 100
C__CI__NA__1 = 101
C_RD_NA_1 = 102
C_CS_NA_1 = 103
C_TS_NA_1 = 104
C_RP_NA_1 = 105
C_CD_NA_1 = 106

# 在控制方向参数的应用服务数据单元
P_ME_NA_1 = 110
P_ME_NB_1 = 111
P_ME_NC_1 = 112
P_AC_NA_1 = 113

# 文件传输的应用服务数据单元
F_FR_NA_1 = 120
F_SR_NA_1 = 121
F_SC_NA_1 = 122
F_LS_NA_1 = 123
F_AF_NA_1 = 124
F_SG_NA_1 = 125
F_DR_TA_1 = 126

"""类型描述"""
TYPE_DESC = {
    M_SP_NA_1: '单点信息', 
    M__SP__TA__1: '带时标的单点信息', 
    M__DP__NA__1: '不带时标的双点信息', 
    M__DP__TA__1: '带时标的双点信息', 
    M__ST__NA__1: '不带时标的步位置信息', 
    M__ST__TA__1: '带时标的步位置信息', 
    M__BO__NA__1: '32比特串', 
    M__BO__TA__1: '带时标的32比特串', 
    M__ME__NA__1: '测量值，规一化值', 
    M__ME__TA__1: '测量值，带时标的规一化值', 
    M__ME__NB__1: '测量值，标度化值', 
    M__ME__TB__1: '测量值，带时标的标度化值', 
    M__ME__NC__1: '测量值，短浮点数', 
    M__ME__TC__1: '测量值，带时标的短浮点数', 
    M__IT__NA__1: '累计量', 
    M__IT__TA__1: '带时标的累计量', 
    M__EP__TA__1: '带时标的继电保护设备事件', 
    M__EP__TB__1: '带时标的继电保护设备成组启动事件', 
    M__EP__TC__1: '带时标的继电保护设备成组输出电路信息', 
    M__PS__NA__1: '带变位检出的成组单点信息', 
    M__ME__ND__1: '测量值，不带品质描述词的规一化值', 
    M__SP__TB__1: '带时标CP56Time2a的单点信息', 
    M__DP__TB__1: '带时标CP56Time2a的双点信息', 
    M__ST__TB__1: '带时标的步位置信息', 
    M__BO__TB__1: '带时标CP56Time2a的32比特串', 
    M__ME__TD__1: '测量值，带时标CP56Time2a的规一化值', 
    M__ME__TE__1: '测量值，带时标CP56Time2a的标度化值', 
    M__ME__TF__1: '测量值，带时标CP56Time2a的短浮点数', 
    M__IT__TB__1: '带时标CP56Time2a的累计量', 
    M__EP__TD__1: '带时标CP56Time2a的继电保护设备事件', 
    M__EP__TE__1: '带时标CP56Time2a的继电保护设备成组启动事件', 
    M__EP__TF__1: '带时标CP56Time2a的继电保护设备成组输出电路信息', 
    C__SC__NA__1: '单命令', 
    C__DC__NA__1: '双命令', 
    C__RC__NA__1: '步调节命令', 
    C__SE__NA__1: '设定命令，规一化值', 
    C__SE__NB__1: '设定命令，标度化值', 
    C__SE__NC__1: '设定命令，短浮点数', 
    C__BO__NA__1: '32比特串', 
    M__EI__NA__1: '初始化结束', 
    C__IC__NA__1: '召唤命令', 
    C__CI__NA__1: '计数量召唤命令', 
    C_RD_NA_1: '读命令', 
    C_CS_NA_1: '时钟同步命令', 
    C_TS_NA_1: '测试命令', 
    C_RP_NA_1: '复位进程命令', 
    C_CD_NA_1: '延时获得命令', 
    P_ME_NA_1: '测量值参数，规一化值', 
    P_ME_NB_1: '测试值参数，标度化值', 
    P_ME_NC_1: '测量值参数，短浮点数', 
    P_AC_NA_1: '参数激活', 
    F_FR_NA_1: '文件准备就绪', 
    F_SR_NA_1: '节准备就绪', 
    F_SC_NA_1: '召唤目录，选择文件，召唤文件，召唤节', 
    F_LS_NA_1: '最后的节，最后的段', 
    F_AF_NA_1: '认可文件，认可节', 
    F_SG_NA_1: '段', 
    F_DR_TA_1: '目录', 
}

"""传送原因的字节数(1 or 2)"""
TRANS_CAUSE_DESC = {
    1: '周期/循环', 
    2: '背景扫描', 
    3: '突发（自发）', 
    4: '初始化', 
    5: '被请求', 
    6: '激活', 
    7: '激活确认', 
    8: '停止激活', 
    9: '停止激活确认', 
    10: '激活终止', 
    11: '远方命令引起的返送信息', 
    12: '当地命令引起的返送信息', 
    13: '文件传输', 
    20: '响应站召唤', 
    21: '响应第1组召唤', 
    22: '响应第2组召唤', 
    23: '响应第3组召唤', 
    24: '响应第4组召唤', 
    25: '响应第5组召唤', 
    26: '响应第6组召唤', 
    26: '响应第6组召唤', 
    27: '响应第7组召唤', 
    28: '响应第8组召唤', 
    29: '响应第9组召唤', 
    30: '响应第10组召唤', 
    31: '响应第11组召唤', 
    32: '响应第12组召唤', 
    33: '响应第13组召唤', 
    34: '响应第14组召唤', 
    35: '响应第15组召唤', 
    36: '响应第16组召唤', 
    37: '响应计数量站（总）召唤', 
    38: '响应第1组计数量召唤', 
    39: '响应第2组计数量召唤', 
    40: '响应第3组计数量召唤', 
    41: '响应第4组计数量召唤', 
    44: '未知的类型标识', 
    45: '未知的传送原因', 
    46: '未知的应用服务数据单元(ASDU)公共地址', 
    47: '未知的信息对象地址', 
}

TRANS_CAUSE_SIZE = 2  # TODO: 系统参数自适应功能未开发完成

"""公共地址的字节数(1 or 2)"""
COMMON_ADDR_SIZE = 2  # TODO: 系统参数自适应功能未开发完成

"""信息对象地址的字节数(1 or 2 or 3)"""
INFO_ADDR_SIZE = 3  # TODO: 系统参数自适应功能未开发完成
